[
  {
    "Id": 1,
    "storyId": 1,
    "title": "The Space Between Life and Death",
    "content": "<p>Between life and death there is a library.</p><p>She hadn't known that, of course. No one knows that while they are alive. No one knows anything while they are alive.</p><p>But now, as Nora Seed stood in the space between living and dying, she could see it clearly. The Midnight Library stretched infinitely in all directions, its shelves reaching up toward a sky that wasn't quite a sky, filled with books that glowed with their own inner light.</p><p>Each book represented a life she could have lived. A different choice. A different path. A different version of herself.</p><p>'Welcome, Nora,' said a voice behind her.</p>",
    "orderIndex": 1,
    "published": true,
    "publishedAt": "2024-01-15T08:30:00Z",
    "createdAt": "2024-01-15T08:00:00Z",
    "updatedAt": "2024-01-15T08:30:00Z",
    "viewCount": 1243,
    "likeCount": 187,
    "commentCount": 23
  },
  {
    "Id": 2,
    "storyId": 1,
    "title": "The Librarian",
    "content": "<p>The woman who greeted her looked familiar, though Nora couldn't quite place her. She was elderly, with kind eyes behind wire-rimmed glasses and grey hair pulled back in a neat bun. She wore a cardigan that seemed to shimmer between different colors as she moved.</p><p>'Mrs. Elm?' Nora whispered, recognizing her old school librarian.</p><p>'In a way,' the woman smiled. 'I am as you remember me, because that is how I can help you most. I am here to guide you through the library, to help you understand what this place offers.'</p><p>Nora looked around in wonder. The library seemed to pulse with possibility, each book a doorway to another life.</p>",
    "orderIndex": 2,
    "published": true,
    "publishedAt": "2024-01-16T09:00:00Z",
    "createdAt": "2024-01-16T08:45:00Z",
    "updatedAt": "2024-01-16T09:00:00Z",
    "viewCount": 1156,
    "likeCount": 164,
    "commentCount": 19
  },
  {
    "Id": 3,
    "storyId": 2,
    "title": "London Calling",
    "content": "<p>The rain drummed against the windows of Sarah's London flat as she stared at the letter in her hands. Her grandmother's handwriting, though shakier than she remembered, was unmistakable.</p><p><em>'My dearest Sarah, if you are reading this, then I have gone to join your grandfather in whatever comes next. I leave you my cottage in Glen Morven, in the Scottish Highlands. I know you have your life in London, but perhaps you might find something there that you didn't know you were looking for.'</em></p><p>Sarah set the letter down and looked around her pristine apartment. Everything was white and chrome and perfectly organized, just like her life. Her law practice was thriving, her calendar was full, and her future was planned out in neat, predictable steps.</p><p>So why did she feel so empty?</p>",
    "orderIndex": 1,
    "published": true,
    "publishedAt": "2024-02-01T10:30:00Z",
    "createdAt": "2024-02-01T10:15:00Z",
    "updatedAt": "2024-02-01T10:30:00Z",
    "viewCount": 987,
    "likeCount": 142,
    "commentCount": 16
  },
  {
    "Id": 4,
    "storyId": 2,
    "title": "Journey North",
    "content": "<p>The train to Scotland cut through countryside that grew progressively wilder as they headed north. Sarah watched villages and towns give way to rolling hills and then to mountains shrouded in mist.</p><p>She had only meant to come for a weekend, to see the cottage and arrange for its sale. But as the landscape changed, she felt something in her chest loosen—a tension she hadn't even realized she'd been carrying.</p><p>Her phone buzzed with messages from work, from clients, from her organized London life demanding her attention. For the first time in years, she turned it off.</p><p>The small station at Glen Morven was little more than a platform and a weather-beaten sign. As Sarah stepped off the train with her single weekend bag, she breathed in air that tasted of pine and rain and freedom.</p>",
    "orderIndex": 2,
    "published": true,
    "publishedAt": "2024-02-03T11:15:00Z",
    "createdAt": "2024-02-03T11:00:00Z",
    "updatedAt": "2024-02-03T11:15:00Z",
    "viewCount": 923,
    "likeCount": 128,
    "commentCount": 14
  },
  {
    "Id": 5,
    "storyId": 3,
    "title": "The Weight of Command",
    "content": "<p>Captain Maya Chen stood on the bridge of the Endeavor, watching Earth shrink to a blue dot in the viewscreen. Behind her, the bridge crew worked in hushed efficiency, their faces grave. They all knew what this meant.</p><p>Earth was dying. The climate collapse had accelerated beyond all predictions, and despite humanity's best efforts, their home world would be uninhabitable within a generation. The Endeavor and her sister ships carried the last hope of the human race—a chance to find a new world among the stars.</p><p>'Captain,' called Lieutenant Torres from the navigation station. 'We're clear of the solar system. Ready to engage the quantum drive.'</p><p>Maya nodded, though her throat felt tight. 'Engage the drive, Lieutenant. Take us to Kepler-442b.'</p><p>As the stars stretched into lines and the ship jumped to faster-than-light speed, Maya thought of the 50,000 people in cryo-sleep in the ship's belly, trusting her to deliver them safely to humanity's new home.</p><p>She would not fail them.</p>",
    "orderIndex": 1,
    "published": true,
    "publishedAt": "2024-01-28T12:45:00Z",
    "createdAt": "2024-01-28T12:20:00Z",
    "updatedAt": "2024-01-28T12:45:00Z",
    "viewCount": 1567,
    "likeCount": 234,
    "commentCount": 31
  },
  {
    "Id": 6,
    "storyId": 3,
    "title": "First Contact",
    "content": "<p>Three months into their journey, the Endeavor encountered something impossible.</p><p>'Captain, you need to see this,' Commander Rodriguez called from the science station, her voice tight with disbelief.</p><p>Maya crossed to look at the displays, and her breath caught. The long-range sensors showed a massive structure ahead—clearly artificial, clearly not human.</p><p>'How big is it?' Maya asked.</p><p>'Approximately fifty kilometers in diameter. It's... it's beautiful, Captain.'</p><p>Indeed it was. The alien construct resembled a crystalline flower blooming in the void, its faceted surfaces catching and reflecting starlight in patterns that seemed almost alive.</p><p>'Are there life signs?'</p><p>'Affirmative. Thousands of them, possibly millions. Captain, I think we've found our first alien civilization.'</p><p>Maya felt the weight of history settling on her shoulders. Humanity's first contact with another intelligent species, and she was responsible for how it unfolded.</p><p>'Red alert. All hands to stations. And someone wake Admiral Chen. History is about to be made.'</p>",
    "orderIndex": 2,
    "published": true,
    "publishedAt": "2024-01-30T14:20:00Z",
    "createdAt": "2024-01-30T14:00:00Z",
    "updatedAt": "2024-01-30T14:20:00Z",
    "viewCount": 1423,
    "likeCount": 198,
    "commentCount": 27
  },
  {
    "Id": 7,
    "storyId": 4,
    "title": "Welcome to Salem Academy",
    "content": "<p>Willow's first glimpse of Salem Academy took her breath away. The Gothic towers rose from the Massachusetts hillside like something from a fairy tale, all pointed spires and leaded windows that glittered in the afternoon sun.</p><p>'Impressive, isn't it?' said the taxi driver, a weathered man with knowing eyes. 'Been taking kids up to that school for thirty years. Always interesting, the ones who go to Salem Academy.'</p><p>Willow clutched her acceptance letter, still hardly believing it was real. After her parents' death in the car accident, she'd thought her life was over. The scholarship to this prestigious private school had seemed like a miracle.</p><p>Now, standing before the massive oak doors carved with symbols she didn't recognize, she wondered if she was ready for whatever came next.</p><p>The doors opened before she could knock, revealing a woman in flowing purple robes with silver hair that seemed to move in a wind that touched nothing else.</p><p>'Welcome, Willow Blackthorne. We've been waiting for you.'</p>",
    "orderIndex": 1,
    "published": true,
    "publishedAt": "2024-02-14T09:30:00Z",
    "createdAt": "2024-02-14T09:00:00Z",
    "updatedAt": "2024-02-14T09:30:00Z",
    "viewCount": 876,
    "likeCount": 156,
    "commentCount": 22
  },
  {
    "Id": 8,
    "storyId": 4,
    "title": "The First Lesson",
    "content": "<p>Willow's roommate was a petite girl with vibrant purple hair and eyes that sparkled with mischief.</p><p>'I'm Luna,' she said, bouncing on her bed. 'Luna Nightshade. And you're the new girl everyone's talking about.'</p><p>'People are talking about me?' Willow asked, unpacking her few belongings.</p><p>'Of course! We don't get many new students mid-semester, especially not ones with your... heritage.'</p><p>Willow frowned. 'My heritage?'</p><p>Luna's eyes widened. 'You don't know? Oh, this is going to be fun. Willow, honey, you're not here because you're smart or talented, though I'm sure you are. You're here because you're a witch. A real, honest-to-goodness, magic-in-your-blood witch.'</p><p>Willow laughed, but the sound died as Luna raised her hand and the candles around the room burst into flame with multicolored light.</p><p>'Welcome to the real world, Willow. Class starts tomorrow.'</p>",
    "orderIndex": 2,
    "published": true,
    "publishedAt": "2024-02-16T10:45:00Z",
    "createdAt": "2024-02-16T10:30:00Z",
    "updatedAt": "2024-02-16T10:45:00Z",
    "viewCount": 823,
    "likeCount": 134,
    "commentCount": 18
  },
  {
    "Id": 9,
    "storyId": 5,
    "title": "The Forgery",
    "content": "<p>Emma stood before the Monet, her heart sinking as she examined the brushstrokes under the magnifying glass. After fifteen years as a museum curator, she knew authentic work when she saw it. This wasn't it.</p><p>The 'Water Lilies' that had been the centerpiece of their impressionist collection for decades was a fake. A very good fake, but a fake nonetheless.</p><p>'Dr. Hart?' Her assistant's voice made her jump. 'The insurance investigator is here to see you.'</p><p>Emma's blood ran cold. She hadn't called any insurance investigator.</p><p>The man who entered her office was tall and lean, with sharp eyes that seemed to catalog every detail. 'Dr. Emma Hart? I'm Detective Inspector Collins. I understand you've discovered some... irregularities in your collection.'</p><p>'I haven't reported anything yet,' Emma said carefully.</p><p>Collins smiled, but it didn't reach his eyes. 'No, but we've been watching your museum for some time. We have reason to believe you're sitting on the largest art forgery operation in the country.'</p>",
    "orderIndex": 1,
    "published": true,
    "publishedAt": "2024-01-05T14:00:00Z",
    "createdAt": "2024-01-05T13:45:00Z",
    "updatedAt": "2024-01-05T14:00:00Z",
    "viewCount": 1234,
    "likeCount": 189,
    "commentCount": 25
  },
  {
    "Id": 10,
    "storyId": 5,
    "title": "Dangerous Knowledge",
    "content": "<p>That night, Emma stayed late at the museum, poring over the authentication records. If the Monet was fake, how many others were compromised? Her systematic check revealed a devastating truth: at least six major pieces showed signs of forgery.</p><p>Someone had been systematically replacing the museum's most valuable works with expertly crafted fakes. But who? And more importantly, where were the originals?</p><p>A sound from the gallery made her freeze. The museum was supposed to be empty except for security. Emma crept toward the sound, her heart pounding.</p><p>In the Renaissance gallery, a figure in black moved stealthily between the paintings, examining each one with a penlight. As Emma watched in horror, the intruder began removing a small Botticelli from its frame.</p><p>She fumbled for her phone to call security, but the device slipped from her trembling hands and clattered to the marble floor.</p><p>The figure spun around, and Emma found herself staring into the cold eyes of someone she trusted.</p><p>Someone who had access to everything.</p>",
    "orderIndex": 2,
    "published": true,
    "publishedAt": "2024-01-07T15:30:00Z",
    "createdAt": "2024-01-07T15:15:00Z",
    "updatedAt": "2024-01-07T15:30:00Z",
    "viewCount": 1178,
    "likeCount": 167,
    "commentCount": 21
  }
]